function Y = KF_2D_example(s, Q, R)
% --------------------------------
%  T = KF_2D_example(s,Q,R)
%  s   位移列向量
%  Q   状态误差协方差矩
%  R   观测误差协方差矩
% --------------------------------
%  对于Dr_CAN 举的匀速前进的例子，假设过程噪声是由于变加速度引起的:
%  S(k+1) = 1*S(k) + T*V(k) + 0.5*T^2*a
%  V(k+1) = 0*S(k) + 1*V(k) + T*a
%  即：
%  X(k+1) = A * X(k)   + G*w(k+1); 预测模型
%  y(k+1) = H * X(k+1) + v(k+1);   观测模型

N = length(s);
T = 1;             % 采样间隔默认为1
A = [1 T;0 1];     % 状态转移矩阵
% G = [0.5*T^2;T];   % 控制量矩阵
H = [1 0];         % 观测矩阵

% 初始化第一个状态
Xu = [s(1); 0];
Pu = [0 0;0 0];
I  = [1 0;0 1];
Y  = zeros(N,2);

for i = 2:N
    Xp = A * Xu;                          % 1. 
    Pp = A * Pu * A.' + Q;                  % 2. 
    K  = Pp * H.' * ( H * Pp * H.' + R)^-1;   % 3. 
    Xu = Xp + K * (s(i) - H * Xp);          % 4. 
    Pu = ( I - K * H ) * Pp;              % 5. 
    
    Y(i,1) = Xu(1);
    Y(i,2) = Xu(2);
end 
end